# ทำโปรแกรมคำนวณพื้นที่สี่เหลี่ยม รับค่ากว้าง ยาว ทางแป้นพิมพ์ แล้วแสดงผลออกมา
print('------------------------')
print('  โปรแกรมหาพื้นที่สี่เหลี่ยม')
print('------------------------')
widths = input('ป้อนความกว้าง: ')
longs = float(input('ป้อนความยาว: '))
area = float(widths) * longs
print('------------------------')
print(f'สี่เหลี่ยมกว้าง {widths} ยาว {longs} มีพื้นที่ {area}') #ใช้ f-string
print('------------------------')
print('สี่เหลี่ยมกว้าง',widths,'ยาว',longs,'มีพื้นที่',area) #ใช้ ,
print('------------------------')
print('สี่เหลี่ยมกว้าง '+widths+' ยาว '+str(longs)+' มีพื้นที่ '+str(area)) #ใช้ +
print('------------------------')
print('สี่เหลี่ยมกว้าง {} ยาว {} มีพื้นที่ {}'.format(widths,longs,area)) #ใช้เมธอด format