# แสดงข้อมูลสอบถามข้อมูลรถเมล์ โดยป้อนสายรถเมล์ที่เราต้องการ แล้วแสดงข้อมูลว่าไปไหน



print('--------------------------------------------------')
print('----------------- สอบถามข้อมูลรถเมล์ -----------------')
print('--------------------------------------------------')
bus_number = input('กรุณากรอกสายรถเมล์: ')
print('--------------------------------------------------')

if bus_number == '84':
    print('สาย 84 อ้อมน้อย วัดไร่ขิง')
elif bus_number == '81':
    print('สาย 81 พรานนก ศิริราช')
elif bus_number == '80':
    print('สาย 80 สนามหลวง  บางขุนนนท์  ปิ่นเกล้า')
elif bus_number == '8':
    print('สาย 8  สะพานพุทธ เดอะมอลบางกะปิ')
elif bus_number == '7':
    print('สาย 7  คลองเตย พระประแดง')
else:
    print('ไม่มีข้อมูลสายรถเมล์นี้')

