# สร้างโปรแกรมคำนวณจำนวนสีที่ต้องใช้ว่าต้องใช้กี่แกลอนในการทาผนังห้องและ
# เพดานของห้องสี่เหลี่ยมโดยให้รับความกว้าง ความยาว ความสูงของห้อง (หน่วยเป็นเมตร) ทางแป้นพิมพ์
# แล้วแสดงผลพื้นที่ที่ต้องทา และจำนวนแกลอนที่คำนวณได้ออกมา โดยสี 1 แกลอนทาได้ 1.25 ตารางเมตร

print('+++++++++++++++++++++++')
print('  โปรแกรมคำนวณสีทาผนัง')
print('+++++++++++++++++++++++')
wi = float(input('ป้อนกว้าง: '))
lo = float(input('ป้อนยาว: '))
hi = float(input('ป้อนสูง: '))
print('+++++++++++++++++++++++')
# area = (wi * hi * 2) + (lo * hi * 2) + (wi * lo)
area = ((wi * hi) + (lo * hi)) * 2 + (wi * lo)
gallon = area / 1.25
print(f'ห้องพื้นที่ {area} ตร.ม. ใช้สี {gallon} แกลอน')
print('+++++++++++++++++++++++')
print()
print('+++++++++++++++++++++++')
print()
print('+++++++++++++++++++++++')
print()
print('+++++++++++++++++++++++')