# #โปรแกรมคำนวณอายุ ค่า BMI และแปรผลค่า BMI ที่คำนวณได้ โดยมีการทำงานของโปรแกรมดังนี้
# - ป้อนชื่อ พ.ศ.เกิด น้ำหนักหน่วยเป็นกิโลกรัม และส่วนสูงเป็นเซ็นติเมตร
# - คำนวณอายุจาก พ.ศ. เกิดโดยไปลบกับปี พ.ศ. ปัจจุบัน และแสดงผล
# - คำนวณค่า BMI จากน้ำหนักและส่วนสูงจากสูตร BMI = น้ำหนัก(กิโลกรัม)/ ส่วนสูง(เมตร)2 และแสดงผล กำหนดให้แสดงจำนวนทศนิยม 2 ตำแหน่ง
# - แปลผลจากค่า BMI และแสดงผล โดย
# 	ค่า BMI น้อยกว่า 18.5 ให้แสดงผล น้ำหนักน้อยไป	
# 	ค่า BMI ตั้งแต่ 18.5 ถึง 22.99 ให้แสดงผล น้ำหนักปกติ
# 	ค่า BMI ตั้งแต่ 23 ถึง 24.99 ให้แสดงผล น้ำหนักเกิน (ท้วม)
# 	ค่า BMI ตั้งแต่ 25 ถึง 29.99 ให้แสดงผล น้ำหนักเกิน (อ้วนระยะเริ่มต้น)
# 	ค่า BMI ตั้งแต่ 30 ถึง 39.99 ให้แสดงผล น้ำหนักเกิน (อ้วนมาก)
# 	ค่า BMI ตั้งแต่ 40 ขึ้นไป ให้แสดงผล น้ำหนักเกิน (อ้วนระดับรุนแรงมาก)
 
 
# ตัวอย่างการทำงานเมื่อรันโปรแกรม
# ****************************************
# ****              BMI Program                ****
# ****************************************
# ป้อนชื่อ : สมชาย
# ป้อนปี พ.ศ. เกิด : 2520
# ป้อนน้ำหนัก : 85 กิโลกรัม
# ป้อนส่วนสูง : 168 เซนติเมตร
# *****************************************
# คุณสมชาย เกิดปี พ.ศ. 2520 อายุ 46 ปี
# น้ำหนัก 85 กิโลกรัม ส่วนสูง 168 เซนติเมตร
# ค่า BMI ที่คำนวณได้ คือ 30.12 
# แปลค่าค่า BMI ที่คำนวณได้ คือ น้ำหนักเกิน (อ้วนมาก)
# *****************************************


def headName():
    print('****************************************')
    print('****              BMI Program                ****')
    print('****************************************')


def info_input():
    name = input('ป้อนชื่อ : ')
    year = int(input('ป้อนปี พ.ศ. เกิด : '))
    weight = float(input('ป้อนน้ำหนัก : '))
    height = float(input('ป้อนส่วนสูง : '))
    return name, year, weight, height

def bmi(weight, height):
    bmi = weight / (height / 100) ** 2
    return bmi


def notice(bmi , name, year, age, weight, height):
    print(f'คุณ{name} เกิดปี {year} อายุ {age} ปี')
    print(f'น้ำหนัก {weight} กิโลกรัม ส่วนสูง {height} เซนติเมตร')
    print(f'ค่า BMI ที่คำนวณได้ คือ {bmi:.2f}')


    if bmi < 18.5:
        print('น้ำหนักน้อยไป')
    elif 18.5 <= bmi < 22.99:
        print('น้ำหนักปกติ')
    elif 23 <= bmi < 24.99:
        print('น้ำหนักเกิน (ท้วม)')
    elif 25 <= bmi < 29.99:
        print('น้ำหนักเกิน (อ้วนระยะเริ่มต้น)')
    elif 30 <= bmi < 39.99:
        print('น้ำหนักเกิน (อ้วนมาก)')
    else:
        print('น้ำหนักเกิน (อ้วนระดับรุนแรงมาก)')

    

def age (year):
    age = 2568 - year
    return age

headName()
name, year, weight, height = info_input()
age = age(year)
bmi = bmi(weight, height)
notice(bmi, name, year, age, weight, height)