# การแปลงข้อมูล
# fundamental 
# แปลงข้อมูลใดๆ
# str() แปลงเป็นข้อความ
# int() แปลงเป็นจํานวนเต็ม
# float() แปลงเป็นจํานวนจริง
# ***********************
# print() แสดงข้อมูล
# input() รับข้อมูล
# ***********************
# สร้างโปรแกรมคำนวณเงินเดือนที่ต้องจ่ายหลังจากหักภาษีแล้ว 7 % และหักค่าประกันสังคม 3 % 
# โดยรับรหัสพนักงาน จาก input และแสดงรหัสพนักงาน ชื่อพนักงาน และเงินเดือนที่ต้องจ่าย
# หักภาษีแล้ว 7 % และหักค่าประกันสังคม 3 % กี่บาท ที่จะต้องจ่าย หักภาษีแล้ว 7 % และหักค่าประกันสังคม 3 % จัดแสดงแยกกัน
# และแสดงรหัสพนักงาน ชื่อพนักงาน และเงินเดือนที่ต้องจ่าย 


print('--------------------------------------------------')
print('+++++++++++++++  โปรแกรมคํานวณเงินเดือน  ++++++++++++')
print('--------------------------------------------------')
employee_id = input("รหัสพนักงาน: ")
employee_name = input("ชื่อพนักงาน: ")
salary = float(input("เงินเดือน: "))


tax_rate = 0.07
social_security_rate = 0.03

tax = salary * tax_rate
social_security = salary * social_security_rate

total_deductions = tax + social_security
net_salary = salary - total_deductions

tax = round(tax, 2)


print('--------------------------------------------------')
print('+++++++++++++++  ภาษีและค่าประกันสังคม  +++++++++++++')
print('--------------------------------------------------')
print("รหัสพนักงาน:", employee_id)
print("ชื่อพนักงาน:", employee_name)
print("เงินเดือน:", salary)
print("ภาษี:", tax)
print("ค่าประกันสังคม:", social_security)
print("เงินเดือนที่ได้รับ:", net_salary)
print('--------------------------------------------------')
print('--------------------------------------------------')













