# ทำโปรแกรมคิดค่า Comission สำหรับพนักงานขาย โดยให้ป้อนชื่อพนักงาน และยอดขาย
# และแสดงชื่อพนักงาน ยอดขาย และค่าคอมมิชชั่น
# ค่าคอมมิชชั่น = ยอดขายเกิน 100000  15% ถ้าไม่เกิน 10%

print('--------------------------------------------------')
print('----------------- คำนวณค่าคอมมิชชั่น -----------------')
print('--------------------------------------------------')
name = input('กรุณากรอกชื่อพนักงาน: ')
sales = float(input('กรุณากรอกยอดขาย: '))
print('--------------------------------------------------')

commission_rate = 0.10


commission = sales * commission_rate

if sales > 100000:
    commission_rate = 0.15
    commission = sales * commission_rate
else:
    commission_rate = 0.10
    commission = sales * commission_rate

commission = f"{commission:,.2f}"
sales = f"{sales:,.2f}"


print('--------------------------------------------------')
print('------------- ข้อมูลพนักงาน และ ค่าคอมมิชชั่น -----------')
print('--------------------------------------------------')
print('ชื่อพนักงาน:', name)
print('ยอดขาย:', sales)
print('ค่าคอมมิชชั่น:', commission)
print('เปอร์เซ็นต์คอมมิชชั่น:', commission_rate * 100 ,'%')
print('--------------------------------------------------')